Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob/facta/skuvlahistorja5/johandaniel-s.html.tmx
Source language: sme
Languages: nob

source: Muhto lávdegoddi lea gávnnahan ahte dát lea plánabargu mii ferte vuordit dassážii go normalplána lea loahpalaččat mearriduvvon.
nob: Men utvalget er kommet til at dette er et planarbeid som bør utstå til normalplanen foreligger i sin endelige form.

source: Muhto dalle berrešii maid dakkaviđe plána dahje bagadallama ráhkadeapmi álggahuvvot – vejolaččat normalplána lasáhussan – mii meannuda juste daid čuolmmaid mat fertejit čovdojuvvot vuođđoskuvllain main leat sámegielat oahppit.»
nob: Men da bør det også straks bli tatt initiativ til å få utarbeidet en plan eller veiledning – eventuelt som et supplement til normalplanen – som går direkte på de problemer en står overfor i grunnskoler med samisktalende elever.»

source: Lávdegoddi nubbi evttohusas, Vuođđoskuvlla normalplána evttohus, eai namuhuvvon sámi ohppiid dilit.
nob: I tråd med dette blei da forholda for samiske elever utelatt i utvalgets andre innstilling, Forslag til normalplan for grunnskolen.

source: Ii ádjánan guhká ovdal go bohte reakšuvnnat.
nob: Det varte ikke lenge før reaksjonene kom.

source: Ovddimus lei Guovdageainnu skuvlaráđđi, mii juovlamánus seammá jagi celkkii earret eará: «a. Plánas ii boađe ovdan ahte gávdnojit sámegielat oahppit Norgga skuvllas ja sámekultuvra Norggas.
nob: I fremste rekke i kritikken sto Kautokeino skoleråd, som i desember samme år uttalte bl.a.: «a. Det går ikke fram av planen at det finnes samisktalende elever i norsk skole og samisk kultur i Norge.

source: Sámegielagiid oahpahus ii leat guoskkahuvvon.
nob: b. Undervisningen for samisktalende elever er ikke berørt.

source: c. Dáru / Sámi guovttegielatvuođa mihttomearri ii leat guoskkahuvvon, eai ge čuolmmat nu gohčoduvvon giellaváttisvuođaid ektui.»
nob: c. Målsettingen for tospråklighet norsk / samisk er ikke berørt, heller ikke vanskene i forbindelse med såkalte språkproblemer.»

source: Guovdageainnus boahtán kritihkka lei gal várra mielde váikkuheamen dasa ahte 1971 gaskaboddosaš plána (M71) oaččui guovttisiidosaš oasáža «Oahppit giellaseaguhusguovlluin», vaikko vel sisdoallu guhkin eret govččai dan maid kritihkkarat ledje sávvan.
nob: Kritikken fra Kautokeino var nok medvirkende til at den midlertidige planen av 1971 (M71), fikk et tosiders kapittel om «Elever i språkblandingsdistrikter», sjøl om innholdet var langt fra det kritikerne hadde ønska.

source: Dán oasážis čilgejuvvo ahte sámi oahppit sáhttet oažžut álgooahpahusa sámegillii, muhto «Lea vuoiggalaš jurdda ahte lea eanáš sámegiella ja sámi kultuvra vuođđoskuvlla vuolit dásiin, ja ahte dárogiella ja kultuvra váldá seammá sajádaga vuođđoskuvlla alit dásiin.»
nob: I dette kapitlet står det at samiske elever kan få begynneropplæring på samisk, men at «Det er rimelig å tenke seg at samisk og den samiske kultur vil dominere på laveste trinn i grunnskolen, og at norsk språk og norsk kultur vil innta denne plassen på de høyeste trinn i grunnskolen.»

source: Máttasámi oahppit leat erenoamážit namuhuvvon, go sidjiide fertejit sierra giellaoahpponeavvut, muhto muđui gal sáhttet čuovvut seammá prinsihpaid go davvisámi oahppit.
nob: Det er spesielt nevnt sørsamiske elever, som må ha eget språkmateriell, men ellers kan man bruke de samme prinsipper som for nordsamiske elever.

source: Dan ektui go 1970-evttohus ii namat ge vierisgielat ohppiid dárogielfágas, de lea M71:s vuosttáš háve sierra oahppoplána dárogiella vierisgiellan.
nob: Mens forslaget fra 1970 ikke nevner fremmedspråklige elever under norskfaget, har M 71 for første gang en egen læreplan for norsk som fremmedspråk.

source: Plána lea vuosttažettiin jurddašuvvon sámegielat ohppiid várás, muhto lea gal namuhuvvon ahte sáhttá heivet maiddái ohppiide geain lea suoma duogáš ja «vierisbargiid mánáide».
nob: Denne planen var i første rekke beregna for samiske elever, men det er nevnt at den også kan være aktuell for elever med finsk bakgrunn og «barn av fremmedarbeidere».

source: Iešguđet fága vuolde leat sápmelaččat namahuvvon dušše oktii.
nob: Under de enkelte faga er samene omtalt direkte bare en gang.

source: Lea orienterenfágas 4. luohká várás.
nob: Det er i orienteringsfaget for 4. klassetrinn.

source: Fáttás Eallin galbma guovlluin namuhuvvojit «Duottar, Ruonáeanan, Kanada: Eskimoat, Davvi-Skandinavia - sápmelaččat.»
nob: Under emnet Livet i kalde strøk er nevnt «Tundraen, Grønland, Canada: Eskimoer, Nord-Skandinavia – samer.»

source: Buorredáhtolaččat dulkojuvvon sáhtášii dadjat ahte sámit muhtun láhkái leat mielde, go Risttalašvuođafágas 7. luohká várás leastadianisma namahuvvo fáttás «Norgga girko- ja risttalašeallin 1800-logus».
nob: Velvillig tolka kan man si at samene indirekte er med når man under kristendomskunnskap for 7. klassetrinn nevner læstadianismen under «Norsk kirke- og kristenliv i 1800-årene.»

source: Boađusin lei ahte sámi skuvlabiras nanusmahtii kritihkas, ja bijai searaid rievdadit loahpalaš oahppoplána.
nob: Resultatet var at samiske skolemiljø forsterka kritikken og satte kreftene inn på å få endringer i den endelige læreplanen.

source: Edel Hætta Eriksen muitala Sámi skuvlahistorjá 1:s: «Giđđat 1972:s lei stuora seminára Guovdageainnus gosa čoahkkanedje oahpaheaddjit, universitehtaolbmot ja olbmot Skuvllaid geahččaladdanráđis.
nob: Edel Hætta Eriksen forteller i Samisk skolehistorie 1: «Våren 1972 ble det holdt et stort seminar i Kautokeino hvor lærere og folk fra universiteter samt fra Forsøksrådet for skoleverket møtte opp.

source: Seminára váldofáddá lei Minsttarplána árvalus ja sámiid skuvladilli.
nob: Tema på seminaret var utkastet til Mønsterplanen samt skolesituasjonen for samene.

source: Seminára ráhkadii cealkámuša mas ee. bivde rievdadit unohis cealkámušaid Minsttarplánas.
nob: Seminaret laget en uttalelse hvor det ble bedt om at den uheldige formuleringen ble endret.

source: Deattuheimmet addit stuorit árvvu sámegillii, sámi historjái ja sámi kultuvrii.
nob: Samisk språk, samisk historie og kultur må gis større verdi.

source: Seminára bijai joavkku Osloi gos besse deaivvadit Stuoradikki girko- ja oahpahuslávdegottiin, ja dohko geigejedje cealkámuša.
nob: En gruppe fikk reise til et møte med Stortingets kirke- og undervisningskomite hvor man overleverte uttalelsen. Jeg var med i gruppa.

source: Mun ledjen mielde joavkkus.
nob: Ny Mønsterplan kom i 1974.

source: Muhtin cealkámušat ledje rievdan, muhto sisdoalus lei ain dáruiduhttinvuoigŋa.
nob: En del setningsformuleringer var rettet, men fortsatt hadde innholdet en fornorskende tendens.

source: Ain deattuhuvvui ahte 3. luohká rájes galggai dárogiella váldogiellan oahpaheamis, sámegiella galggai fágan.»
nob: Fortsatt ble det påpekt at fra 3. klassetrinn skulle norsk være hovedspråk, mens samisk skulle være et fag.»

source: Kritihkka M 71 vuostá fátmmastii guokte váldofáttá: Sámegiela ja dárogiela sajádat oahpahusas ja iešguđet fágaplánaid váilevaš sámi sisdoallu.
nob: Kritikken av M 71 gikk på to hovedområder: stillingen til samisk og norsk språk i opplæringa og mangelen på samisk innhold i de enkelte fagplanene.

source: Vuosttaš fáttá olis eai lean áktánas bohtosat.
nob: På det første området var resultata magre.

source: Cealkka mii čilgii ahte dárogiella dađistaga galggai šaddat váldogiellan, bisuhuvvui.
nob: Formuleringa om overgang til norsk som hovedspråk blei beholdt.

source: Muhto sámegiella šattai oahppoplána oassin, ja bohte maid mielde viehka máŋga čuoggá sámi diliid birra ruovttudoalu, orienterenfága, historjjá, servvodatfága, dipmaduoji ja musihka oahppoplánain.
nob: Derimot kom samiskfaget inn i læreplanen, og det kom inn ganske mange punkter om samiske forhold i læreplanene i heimstadlære, orienteringsfag, historie, samfunnsfag, handarbeid og musikk.

source: [25] Diet čuoggát leat Guovdageainnu skuvlaráđi ja seminára, man ovddas ráđđi áŋgirušai, oinnolaš bohtosat.
nob: [25] Disse punkta er tydelig resultat av forslaga fra Kautokeino skoleråd og seminaret som det tok initiativ til.

source: Sámi guovllu oahpaheddjiide lei dehálaš ahte dál sáhtte oahpahit sámi fáttáid buot dáin fágain, oahppoplána mielde.
nob: For lærere i samiske områder var det viktig at de nå hadde dekning i læreplanen for å undervise i samiske emner i faga.

source: Ii oahppoplána ráddjen man ge láhkái mat fáttát galge leat sámi guovlluid várás, ja muđui riikkas.
nob: Læreplanen gir ingen retningslinjer for hva som gjelder for samiske områder og hva som gjelder for resten av landet.

source: Buot oahppit riikkas galge prinsihpas oažžut dán oahpahusa sámi diliid birra, muhto go oahpaheaddjit ja oahppogirječállit váillahedje dieđu fáttáin, de lei várra dávjá nu ahte dát fáttát eai oahpahuvvon.
nob: Alle elever i landet skulle i prinsippet få denne opplæringa om samiske forhold, men uten at lærere og lærebokforfattere hadde tilstrekkelig med kunnskaper kunne det nok ofte mangle mye på at dette blei gjennomført.

source: Odd Mathis Hætta čálii ná 1979:s: «Minsttarplánas leat evttohuvvon moanat fáttát sámiid birra.
nob: Odd Mathis Hætta skreiv slik i 1979: «I Mønsterplanen er det foreslått en del emner om samer.

source: Dát dáidet leat doarvái oahpásmahttit dáža mánáid sámiide, muhto fáttát eai gal govčča sámi guovlluid mánáid oahpahusa.»
nob: Disse er kanskje tilstrekkelig for å gjøre norske barn oppmerksom på samer, men emnene vil ikke dekke undervisningen av barn i samiske områder.»

source: Sihke M71:s ja M74:s lea boazodoallomáhttu vejolaš válljenfágan.
nob: Både M 71 og M 74 har reindriftskunnskap som mulig valgfag.

source: Dat lea láhččon jahkekursii 2-3:in vahkkodiimmuin.
nob: Det er et opplegg for et årskurs på 2–3 timer pr. uke.

source: Oahppoplána lea hui oanehaččat čilgejuvvon, dat guhkkin eret govččai kurssa mii Kárášjoga suorgejuhkkojuvvon nuoraidskuvlla ohppiide fállojuvvui moadde jagi ovdal, dalle go doppe lei boazodoallosuorgi.
nob: Læreplanen er svært kort, og det er langt fra det omfattende kurset som elevene fikk da det noen år tidligere var reindriftslinje ved den linjedelte ungdomsskolen i Karasjok.

source: Sámi oahpaheaddjit ledje hui duhtameahttumat sámegielfága fuones stáhtusiin M74:s. Nils Thomas Utsi, dalá oahpaheaddji Láhpoluobbala skuvllas, celkkii Sámiid Hilat-áviisii 1978:s: «— Olmmoš ii galgasii gáddit ahte Minsttarplána leat pedagogat čállán.
nob: Blant samiske lærere var det stor misnøye med den lave statusen samiskfaget og undervisning på samisk hadde i M 74. Nils Thomas Utsi, daværende lærer ved Láhpoluoppal skole, uttalte til avisa Sámiid Hilat i 1978: — Man skulle ikke tro at Mønsterplanen var skrevet av pedagoger.

source: «Ulbmilin lea ovttadássásažžan šaddat, ja dan juksá go sámegielat oahppit ožžot vuođđooahpahusa mii lea ovttaárvosaš dainna maid buot dáža nuorat ožžot, čuožžu čállon.
nob: «Målet er likestilling, og det kan bare oppnås ved at samisktalende elever får en grunnskoleutdanning som er helt likeverdig med den all annen norsk ungdom får», – står det.

source: Mun lean seamma oaivilis ahte máhtáhus galgá leat ovttaárvosaš, muhto dat ii sáhte leat ovttaláhkásaš.
nob: Jeg kan være enig i at utdanningen bør være likeverdig, men den kan ikke være identisk lik.

source: Minsttarplána vuoigŋa lea ain: Go leat dárogiela oahppan, de leat ovttadási.
nob: Ånden i Mønsterplanen er ennå: Når man har lært norsk er man likestilt.

source: Vaikko vel eai lean áktánas bohtosat 70-logu álggu oahppoplánariiddus, de bukte sámi skuvlabirrasiid jurdagat stuorát bohtosiid áiggi mielde.
nob: Til tross for det begrensa resultatet av læreplanstriden på begynnelsen av 1970-tallet, skulle initiativet fra samiske skolemiljø føre til større resultater på lengre sikt.

source: Sámi gáibádusaide lei vuosteháhku stuoris girko- ja oahpahusdepartemeanttas, muhto maiddái guovddáš skuvlahálddahusas gávdnojedje olbmot geat buorebut ipmirdedje sámi ohppiid dárbbuid.
nob: De samiske krava møtte mye motbør i Kirke- og undervisningsdepartementet, men også innafor den sentrale skoleadministrasjonen fantes det folk med større forståelse for behova til samiske elever.

source: Dat guoskkai erenoamážit Skuvllaid geahččaladdanráđđái [28].
nob: Det var særlig tilfelle i Forsøksrådet [28].

source: Edel Hætta Eriksen nammaduvvui 1973:s Skuvllaid geahččaladdanráđi vuosttaš sámi miellahttun ja ráđđi nammadii «Ráđđeaddi lávdegotti giellaseaguhusguovlluid oahpahus- ja oahpposuorggi doaimmaid plánemii».
nob: Edel Hætta Eriksen blei oppnevnt som det første samiske medlem av Forsøksrådet i 1973, og rådet satte ned et «rådgivende utvalg for planlegging av tiltak innen undervisnings- og utdanningssektoren i språkblandingsområdene».

source: Lávdegoddi evttohii 1974:s earret eará vuođđudit «Sámi guovlluid geahččaladdan- ja ovdánahttinbargguid pedagogalaš guovddáža».
nob: Utvalget foreslo i 1974 blant annet oppretting av «Pedagogisk senter for forsøks- og utviklingsarbeid i samiske områder».

source: Dát gal ii vuođđuduvvon juste nu mo evttohuvvui, muhto lávdegotti evttohus lei vuođđun dasa go Sámi oahpahusráđđi vuođđuduvvui guokte jagi maŋŋá.
nob: Det blei ikke oppretta akkurat slik som foreslått, men innstillinga til utvalget var mye av grunnlaget for at Samisk utdanningsråd blei oppretta to år seinere.

source: M87: Vuosttamuš sámi oahppoplánat
nob: M87: Første samiske læreplaner

source: Álggoálggus eai galgan 1980-logus ráhkadit áibbas ođđa oahppoplánaid, jurdda lei M 74 revideret. Rievdadusat šadde liikká dađistaga nuppástussan, earret eará eai addon šat bákkolaš fáttát juohke jahkeceahki ovddas, muhto 3-jagi-osiid várás.
nob: I utgangspunktet skulle man på 1980-tallet ikke lage helt nye læreplaner, bare revidere M 74. Endringene blei likevel etter hvert ganske store, blant annet blei de obligatoriske emnene ikke lenger angitt for hvert årstrinn, men for tre-års-bolker.

source: Oahppoplánabarggu olis bohciidii riidu moanain prinsihppagažaldagain.
nob: Under læreplanarbeidet blei det strid om flere prinsippspørsmål.

source: 12.01.1984 fápmudahtii Girko- ja oahpahusdepartemeanta Vuođđoskuvlaráđi ráhkadit ođđa oahppoplána gulaskuddanálgoevttohusa.
nob: 12.01.1984 ga Kirke- og undervisningsdepartementet Grunnskolerådet mandat til å lage høringsutkast til en ny læreplan.

source: Doppe čállojuvvo «mihttomearri lea dihtomielalaččabut deattuhit oktasaš oahppohivvodaga ja oktasaš gálggaid».
nob: Der het det at «en tar sikte på en mer bevisst vektlegging av felles stoff og felles ferdigheter».

source: 1984 čavčča bođii Vuođđoskuvlla minsttarplána gulaskuddanálgoevttohus – oppalaš oassi, ja ođđajagi 1985 bođii gis fágaplánaoassi.
nob: Høsten 1984 kom Høringsutkast til Mønsterplan for grunnskolen - generell del, og på nyåret 1985 fagspesifikk del.

source: Girko- ja oahpahusministtar Kjell Magne Bondevik oassálasttii ieš oahppoplánaprosessii, earret eará danin go áiggui nannet risttalašvuođa posišuvnna skuvllas, ja son ieš fuolahii moanaid rievdademiid gulaskuddanálgoevttohusas ovdalgo gaskaboddosaš plána 1985 gárvvistuvvui.
nob: Kirke- og undervisningsminister Kjell Magne Bondevik greip personlig inn i læreplanprosessen, bl.a. for å styrke kristendommens stilling i skolen, og han pressa gjennom flere endringer fra høringsutkastet til den midlertidige planen av 1985.

source: Plána gohčoduvvui M85, muhto plána deaddiluvvui easka 1986:s, ja departemeanta čállá ovdasánis ahte plána «sáhttá váldojuvvot atnui skuvlajagi 1986/87 rájes dan botta go vuordit Stuorradikki meannudeami Stuorradiggedieđáhusa minsttarplána birra».
nob: Den midlertidige planen blei kalt M85, men planen blei først trykt i 1986, og departementet skriver i forordet at den «kan tas i bruk fra skoleåret 1986/87 i påvente av behandling i Stortinget av en stortingsmelding om mønsterplanen».

source: Ovdal go loahpalaš plána gárvánii 1987:s lei leamaš ráđđehusmolsun.
nob: Før den endelige planen forelå i 1987 hadde det vært regjeringsskifte.

source: Bargiidbellodatráđđehus mii dalle lei beassán fápmui, máhcahii máŋga Bondevika rievdadeami.
nob: Arbeiderpartiregjeringa som da hadde overtatt, reverserte flere av Bondeviks endringer i planen.

source: Vaikko vel departemeanta lei háliidan eambbo oktasaš oahppohivvodaga, de šattai 1987-plána loahpaloahpas plána mii deattuhii báikkálaš oahppoplánabarggu eanet go sihke ovddit ja maŋit plánat.
nob: Til tross for departementets mandat om mer felles stoff, endte planen av 1987 med å legge større vekt på lokalt læreplanarbeid enn både tidligere og seinere planer.

source: Seammás go oahppoplánabargu dáhpáhuvai, de bođii dehálaš láhkarievdadus.
nob: Samtidig med at læreplanarbeidet pågikk, skjedde det ei viktig endring av lovverket.

source: Vuođđoskuvlalága § 40.7 – rievdadusain oaččui sámegiella 1985:s oahpahusgiella-stáhtusa: «Sámi guovlluid mánát galget oažžut oahpahusa sámegielas dahje sámegillii mánáidskuvladásis.
nob: Ved ei endring i grunnskoleloven § 40.7 i 1985 fikk samisk status som opplæringsmål: «Barn i samiske distrikter skal få undervisning i eller på samisk på barnetrinnet.

source: Oahppi vállje ieš háliida go sámegiela fágan nuoraidskuvladásis.»
nob: Eleven velger selv om han / hun vil ha samisk som fag på ungdomstrinnet.»

source: Dáinna lei buorre muddui čađahuvvon dat, man ovddas sámi skuvlabiras lei rahčan M 74 barggu olis, muhto maid dalle ii olahan.
nob: Med dette hadde man langt på veg gjennomført det som samiske skolemiljøer kjempa for under arbeidet med M74, men ikke nådde fram med den gang.

source: Muhto dát rievdadus ii boahtán álkit gal.
nob: Men denne endringa kom ikke av seg sjøl.

source: Sámi oahpahusráđđi, mii lei dán rievdadusa jođihanfápmu, deaivvai garra vuostehágu departemeanttas.
nob: Samisk utdanningsråd, som var drivkrafta bak endringa, opplevde stor motstand i departementet.

source: [29] Sihke M85:s ja M87:s lei oppalaš oassi ja fágaspesifihkka oassi.
nob: [29] Både M 85 og M 87 besto av en generell del og en fagspesifikk del.

source: Dan ektui go M 74 oppalaš oasis lei oasáš «Oahppit giellaseaguhusguovlluin», de sirrii 1984 gulaskuddanálgoevttohus «Sámi ohppiid» ja «Gielalaš unnitlogujoavkkuid» gaskkas, ja sirren doalahuvvui plánain.
nob: Mens den generelle delen av M 74 hadde kapitlet «Elever i språkblandingsområder», skilte høringsutkastet av 1984 mellom «Samiske elever» og «Språklige minoriteter», og denne inndelinga blei beholdt i planene.

source: Fágaspesifihkka oasis lei M74:s fága «Sámegiella čállinhábmemiin», muhto M 85 sirrii «Sámegiella vuosttašgiellan» ja «Sámegiella nubbingiellan».
nob: I den fagspesifikke delen hadde M 74 faget «Samisk med skriftforming», mens M 85 skilte mellom «Samisk som førstespråk» og «Samisk som andrespråk».

source: Goappašagat ledje čállon sihke sámegillii ja dárogilli, muhto oasáš «Sámi oahppit» deaddiluvvui dušše dárogillii.
nob: Begge disse planene var skrevet både på samisk og norsk, mens kapitlet «Samiske elever» bare var trykt på norsk.

source: Dárogieloahpahusa hárrái sirrii M 74 «Dárogiella čállinhábmemiin» «Dárogiella vierisgiellan» - fágain.
nob: For norskundervisninga skilte M 74 mellom «Norsk m» / skriftforming og «Norsk som fremmedspråk».

source: Vierisgielladoaba lonuhuvvo nubbingielladoahpagiin, ja das sirrejuvvojit maid «Dárogiella nubbingiellan ohppiid várás geain lea sámegiella vuosttašgiellan» ja «Dárogiella nubbingiellan gielalaš unnitlogujoavkkuid várás».
nob: Her skjer det to viktige endringer i M 85. Begrepet fremmedspråk byttes ut med andrespråk og det skilles mellom «Norsk som andrespråk for elever med samisk som førstespråk» og «Norsk som andrespråk for språklige minoriteter.»

source: Sámi oahpahusráđi [30] vuođđudemiin ledje sámi skuvlabirrasat ožžon virggálaš rolla skuvlahálddahusas, mii mielddisbuvttii ahte sámit buorebut besse báidnit oahppoplánabargguid.
nob: Med opprettinga av Samisk utdanningsråd [30] hadde samiske skolemiljø fått en formell rolle i skoleadministrasjonen som skulle gi bedre samisk innvirkning på læreplanarbeidet.

source: 1980-logu oahppoplánaođastusa olis lei oahpahusráđđi sierra sámi oahppoplánaid váldojođihanfápmun.
nob: Under læreplanreformen på 1980-tallet var utdanningsrådet hoveddrivkrafta for å få egne samiske læreplaner.

source: Oahpahusráđi vuosttaš direktevra, Edel Hætta Eriksen, muitala das Sámi skuvlahistorjjá 1:s: Sámi oahpahusráđđi gulai ahte Minsttarplána vuođđoskuvlii galggai ođasmahttojuvvot ja čálii Girko- ja oahpahusdepartementii.
nob: Den første direktøren for utdanningsrådet, Edel Hætta Eriksen, forteller om dette i Samisk skolehistorie 1: Samisk utdanningsråd fikk høre at Mønsterplanen skulle revideres og gjorde i 1984 en henvendelse til Kirke- og undervisningsdepartementet med forslag om å lage en samisk mønsterplan.

source: Sámi oahpahusráđđi bovdejuvvui ráhkadit oahppoplánaid, vuosttažettiin sámegielas vuosttašgiellan ja nubbingiellan.
nob: Samisk utdanningsråd ble så bedt om å lage læreplaner, først i samisk som førstespråk og andrespråk.

source: Sámi oahpahusráđđi mieđai dasa, muhto seammás gáibidii ráhkadit sierra sámi oahppoplána buot fágaide....
nob: Rådet gikk med på det, men krevde samtidig at det skulle lages egne samiske læreplaner i alle fag....

source: Vaikko šattaimet bidjat dáža plána M 87 vuođđun, de almmatge lei vuosttaš sámi oahppoplána.»
nob: Selv om vi måtte legge den norske planen M 87 til grunn, så var det likevel den første samiske læreplanen.»

source: [31] Guovttegielatvuohta šattai dál oahpahusa mihttomearrin sihke sámiid ja sisafárrejeddjiid várás.
nob: [31] Tospråklighet blei nå målet for opplæringa både for samer og innvandrere, ei målsetting som man seinere i stor grad har gått bort fra.

source: 1989:s almmuhuvvui Minsttarplána 2. oassi sámi fágaplánaiguin čieža vuođđoskuvlafágii.
nob: I 1989 blei del 2 av Mønsterplanen utgitt med samiske fagplaner for sju fag i grunnskolen.

source: Garra digaštallamiid maŋŋá almmuhuvvui sierra girjin.
nob: Etter en del strid blei denne utgitt som egen bok.

source: Das eai leat njuolggadusat mat máinnašit geat galget oahppoplána čuovvut, dat lei gielddaid ja skuvllaid duohken.
nob: Her er det ikke gitt noen retningslinjer for hvem som skal bruke denne læreplanen.

source: Lea váttis dadjat juste gos plána geavahuvvui.
nob: Det blei overlatt til den enkelte kommune eller skole.

source: Mii diehtit ahte plána geavahuvvui goit muhtun muddui Guovdageainnu, Kárášjoga, Porsáŋggu ja Unjárgga skuvllain, ja de vel moatti Deanu-skuvllas ja erenoamáš sámeskuvllain Málatvuomis, Aarbortes ja Snoasas.
nob: Vi vet at planen blei brukt i større eller mindre grad i Kautokeino, Karasjok, Porsanger, Nesseby samt to skoler i Tana og de spesielle sameskolene i Målselv, Hattfjelldal og Snåsa. Men sjøl her blei ikke den samiske planen brukt fullt ut for alle.

source: Muhto eai doppe ge buohkat geavahan ollásit sámi plána.
nob: Noen skoler brukte bare deler av den samiske planen.

source: Skuvllain main ledje bálddalas sámegiel ja dárogiel luohkát, orru plána unnán geavahuvvon dárogiel luohkáin.
nob: For skoler som hadde samisktalende og norsktalende parallellklasser, blei den samiske planen i liten grad brukt i de norsktalende klassene.

source: Našunála oahppoplánain ledje ain oasážat sámiid birra muhtun fágain, nu mo mánáidskuvlla o-fágas [32] ja nuoraidskuvlla servvodatfágas.
nob: De nasjonale læreplanene beholdt avsnitt om samene i visse fag, som o-fag [32] for barneskolen og samfunnsfag for ungdomsskolen.

source: Eará fágain, nu mo musihkas ja duojis, sihkkojuvvojedje sámi fáttát. Dat elle viiddáseappot duššefal sámi plánain.
nob: I andre fag, som musikk og forming, blei de samiske emnene nå tatt ut og bare videreført i de samiske læreplanene.
